Documents/ПродажаТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПродажаТовара</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиТоваров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>СписокТоваров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПродажаТовара/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// 1) Получить данные из ТЧ запросом   
		
	Запрос = Новый Запрос; 
	МВТ = Новый МенеджерВременныхТаблиц;  
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПродажаТовараСписокТоваров.Товар КАК Товар,
		|	СУММА(ПродажаТовараСписокТоваров.Количество) КАК Количество
		|ПОМЕСТИТЬ ВТ_ТЧ_Абра
		|ИЗ
		|	Документ.ПродажаТовара.СписокТоваров КАК ПродажаТовараСписокТоваров
		|ГДЕ
		|	ПродажаТовараСписокТоваров.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПродажаТовараСписокТоваров.Товар
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Товар
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТЧ_Абра.Товар КАК Товар,
		|	ВТ_ТЧ_Абра.Количество КАК Количество
		|ИЗ
		|	ВТ_ТЧ_Абра КАК ВТ_ТЧ_Абра";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();   
	
	//    МассивТоваров = Новый Массив;
	
	
	// 2) Передать данные в регистр

	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл   
		
		СтрРегистра = Движения.ОстаткиТоваров.ДобавитьРасход();
		СтрРегистра.Период = Дата; 
		СтрРегистра.КоличествоАбра = ВыборкаДетальныеЗаписи.Количество;
		СтрРегистра.ТоварАбра = ВыборкаДетальныеЗаписи.Товар;  
		
	//	МассивТоваров.Добавить(ВыборкаДетальныеЗаписи.Товар);
			
	КонецЦикла;  	
	
		
	// 3) Записать ПРИНУДИТЕЛЬНО данные регистра в БД
	
	Движения.ОстаткиТоваров.БлокироватьДляИзменения = Истина;
	 Движения.ОстаткиТоваров.Записывать = Истина;
	 Движения.Записать(); // Запись окажется в БД и дальше мы сможем ее проверить (увидеть)
	
	// 4) Проверить данные в БД на отрицательные остатки  в виртуальной таблицыОстатки РН ОстаткиТоваров 
		
	Запрос = Новый Запрос; 
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиТоваровОстатки.ТоварАбра КАК ТоварАбра,
		|	ОстаткиТоваровОстатки.КоличествоАбраОстаток КАК КоличествоАбраОстаток,
		|	ОстаткиТоваровОстатки.ТоварАбра.Представление КАК ТоварАбраПредставление
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваров.Остатки(
		|			&МоментВремени,
		|			ТоварАбра В
		|				(ВЫБРАТЬ
		|					Т.Товар
		|				ИЗ
		|					ВТ_ТЧ_Абра КАК Т)) КАК ОстаткиТоваровОстатки
		|ГДЕ
		|	ОстаткиТоваровОстатки.КоличествоАбраОстаток < 0";  
	
	
       //	Запрос.УстановитьПараметр("ТоварАбра", СписокТоваров.ВыгрузитьКолонку("Товар");
	//    Запрос.УстановитьПараметр("ТоварАбра", МассивТоваров);     	   
		   
	Граница = Новый Граница(МоментВремени(), ВидГраницы.Включая); 
	Запрос.УстановитьПараметр("МоментВремени", Граница); 
	
	РезультатЗапроса = Запрос.Выполнить();   
	
	// 5) Если проверку не прошли, запретить проведение документа
      // Если наш запрос что-то нашел, запрещаем проведение и сообщаем чего не хватает
	  
	  Если РезультатЗапроса.Пустой() = Ложь  Тогда
		  // Продать товар "в минус" нельзя, в момент продажи необходимо проверять остаток товара
		  Отказ = Истина; // запрещаем проведение документа. Параметр который есть у обработчика	
		  
		  
		  ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		  
		  Пока ВыборкаДетальныеЗаписи.Следующий() Цикл    
			  // для сообщения
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Не хватает товара %1 в количестве %2 шт/кг ",
			                                            ВыборкаДетальныеЗаписи.ТоварАбраПредставление,
			                                            - ВыборкаДетальныеЗаписи.КоличествоАбраОстаток);
			Сообщение.Сообщить();  
			  
		  КонецЦикла;
	  КонецЕсли; 
	
КонецПроцедуры
